{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "Sequence",
    "normalizers": [
      {
        "type": "NFD"
      },
      {
        "type": "Lowercase"
      },
      {
        "type": "StripAccents"
      }
    ]
  },
  "pre_tokenizer": {
    "type": "Sequence",
    "pretokenizers": [
      {
        "type": "Whitespace"
      },
      {
        "type": "Digits",
        "individual_digits": true
      }
    ]
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "[CLS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "SpecialToken": {
          "id": "[CLS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "[CLS]": {
        "id": "[CLS]",
        "ids": [
          1
        ],
        "tokens": [
          "[CLS]"
        ]
      },
      "[SEP]": {
        "id": "[SEP]",
        "ids": [
          2
        ],
        "tokens": [
          "[SEP]"
        ]
      }
    }
  },
  "decoder": null,
  "model": {
    "type": "WordLevel",
    "vocab": {
      "[UNK]": 0,
      "[CLS]": 1,
      "[SEP]": 2,
      "[PAD]": 3,
      "[MASK]": 4,
      "(": 5,
      ";": 6,
      ",": 7,
      "=": 8,
      ")": 9,
      "i": 10,
      "0": 11,
      "<": 12,
      ".": 13,
      "1": 14,
      "}": 15,
      "int": 16,
      "[": 17,
      "{": 18,
      "a": 19,
      "n": 20,
      "t": 21,
      ">": 22,
      ");": 23,
      "x": 24,
      "return": 25,
      "2": 26,
      "b": 27,
      "if": 28,
      "#": 29,
      "-": 30,
      "&": 31,
      "<<": 32,
      "const": 33,
      "v": 34,
      "for": 35,
      "]": 36,
      "::": 37,
      "+": 38,
      "c": 39,
      "*": 40,
      "s": 41,
      "std": 42,
      ":": 43,
      "p": 44,
      "r": 45,
      "j": 46,
      "long": 47,
      "ll": 48,
      "==": 49,
      "vector": 50,
      "l": 51,
      "3": 52,
      "m": 53,
      "//": 54,
      "){": 55,
      ">>": 56,
      "y": 57,
      "include": 58,
      "()": 59,
      "template": 60,
      "d": 61,
      "define": 62,
      "k": 63,
      "();": 64,
      "4": 65,
      "using": 66,
      "\"": 67,
      "void": 68,
      "];": 69,
      "u": 70,
      "/": 71,
      "h": 72,
      "class": 73,
      "cout": 74,
      "][": 75,
      "operator": 76,
      "else": 77,
      "mint": 78,
      "mod": 79,
      "++)": 80,
      "cin": 81,
      "6": 82,
      "%": 83,
      "size": 84,
      "typename": 85,
      "f": 86,
      "e": 87,
      "this": 88,
      "point": 89,
      "+=": 90,
      "<=": 91,
      "in": 92,
      "5": 93,
      "bool": 94,
      "while": 95,
      "].": 96,
      "),": 97,
      "w": 98,
      "rep": 99,
      "8": 100,
      "print": 101,
      "main": 102,
      "res": 103,
      "ans": 104,
      "&&": 105,
      "9": 106,
      "modint": 107,
      "auto": 108,
      "endl": 109,
      "};": 110,
      "],": 111,
      "namespace": 112,
      "g": 113,
      "ret": 114,
      ">=": 115,
      "q": 116,
      "))": 117,
      "os": 118,
      "!=": 119,
      "->": 120,
      "string": 121,
      "'": 122,
      "end": 123,
      "())": 124,
      "self": 125,
      "begin": 126,
      "));": 127,
      "7": 128,
      "double": 129,
      "true": 130,
      ").": 131,
      "false": 132,
      "pair": 133,
      "rhs": 134,
      "(),": 135,
      "constexpr": 136,
      "):": 137,
      "unsigned": 138,
      "\\": 139,
      "\",": 140,
      "input": 141,
      "static": 142,
      ";}": 143,
      "++){": 144,
      "vec": 145,
      "node": 146,
      "().": 147,
      "])": 148,
      "public": 149,
      "((": 150,
      "line": 151,
      "_v": 152,
      ">;": 153,
      "?": 154,
      "range": 155,
      "first": 156,
      "(\"": 157,
      "]);": 158,
      "len": 159,
      ">::": 160,
      "val": 161,
      "map": 162,
      "value": 163,
      "*=": 164,
      "ostream": 165,
      "type": 166,
      "\";": 167,
      "second": 168,
      "(\"%": 169,
      "max": 170,
      "-=": 171,
      "min": 172,
      ")(": 173,
      "struct": 174,
      "break": 175,
      ">(": 176,
      "());": 177,
      "tmp": 178,
      "printf": 179,
      "dp": 180,
      "new": 181,
      "cnt": 182,
      "inline": 183,
      "++": 184,
      "id": 185,
      "to": 186,
      "push_back": 187,
      "++;": 188,
      "(){": 189,
      "]=": 190,
      "||": 191,
      "[]": 192,
      "__va_args__": 193,
      "sum": 194,
      "split": 195,
      "is": 196,
      "(*": 197,
      "inf": 198,
      "z": 199,
      "cerr": 200,
      "char": 201,
      "root": 202,
      "abs": 203,
      "num": 204,
      "head": 205,
      "right": 206,
      "left": 207,
      "array": 208,
      "args": 209,
      "now": 210,
      "let": 211,
      "\");": 212,
      "out": 213,
      "str": 214,
      "all": 215,
      ">&": 216,
      "assert": 217,
      "typedef": 218,
      "lhs": 219,
      "iostream": 220,
      "bits": 221,
      "scanner": 222,
      "\")": 223,
      "_": 224,
      "tail": 225,
      "(!": 226,
      "system": 227,
      "internal": 228,
      "st": 229,
      "scanf": 230,
      "++.": 231,
      "stdc": 232,
      "count": 233,
      "continue": 234,
      "name": 235,
      "key": 236,
      "istream": 237,
      "sgn": 238,
      "...": 239,
      "ps": 240,
      "eps": 241,
      "dist": 242,
      "|": 243,
      "';": 244,
      "circle": 245,
      "mid": 246,
      "<<(": 247,
      "idx": 248,
      "def": 249,
      "op": 250,
      "next": 251,
      "nullptr": 252,
      "import": 253,
      "and": 254,
      "list": 255,
      "sort": 256,
      "inv": 257,
      "at": 258,
      "<<\"": 259,
      "segment": 260,
      "sc": 261,
      "yes": 262,
      "println": 263,
      "')": 264,
      "no": 265,
      "=(": 266,
      "umod": 267,
      "dfs": 268,
      "scan": 269,
      "friend": 270,
      "mut": 271,
      "edge": 272,
      "get": 273,
      "{}": 274,
      "pow": 275,
      "size_t": 276,
      "(...)": 277,
      ");}": 278,
      "=>": 279,
      "--)": 280,
      "_t": 281,
      "\"<<": 282,
      ")]": 283,
      "swap": 284,
      "nextint": 285,
      "/=": 286,
      "coordinate_t": 287,
      "('": 288,
      "data": 289,
      "cost": 290,
      "pragma": 291,
      "parent": 292,
      "o": 293,
      "top": 294,
      "it": 295,
      "from": 296,
      "append": 297,
      "push": 298,
      "mod_int": 299,
      "set": 300,
      "que": 301,
      "sz": 302,
      "%=": 303,
      "atcoder": 304,
      "stdio": 305,
      "--;": 306,
      "emplace_back": 307,
      "endif": 308,
      "index": 309,
      "length": 310,
      "null": 311,
      "tree": 312,
      "digit": 313,
      "debug": 314,
      "add": 315,
      "java": 316,
      "intersect": 317,
      "'\\": 318,
      "resize": 319,
      "private": 320,
      "arr": 321,
      "\"\\": 322,
      "tie": 323,
      ">>=": 324,
      "result": 325,
      "cur": 326,
      "<(": 327,
      "ok": 328,
      ",-": 329,
      "solve": 330,
      "distance": 331,
      "$": 332,
      "graph": 333,
      "noexcept": 334,
      "pi": 335,
      "ch": 336,
      "chmin": 337,
      "/*": 338,
      "(-": 339,
      "*(": 340,
      "ld": 341,
      "empty": 342,
      ">>(": 343,
      "fn": 344,
      "flag": 345,
      "});": 346,
      "var": 347,
      "chmax": 348,
      "sync_with_stdio": 349,
      "find": 350,
      "dice": 351,
      "itr": 352,
      "pop": 353,
      ">,": 354,
      "{};": 355,
      "fact": 356,
      "elif": 357,
      "(&": 358,
      "*/": 359,
      "util": 360,
      "polygon": 361,
      "--": 362,
      "case": 363,
      "ios": 364,
      "temp": 365,
      "`": 366,
      "mat": 367,
      "math": 368,
      "dir": 369,
      "stack": 370,
      "\",&": 371,
      "other": 372,
      "]-": 373,
      "pb": 374,
      "tuple": 375,
      "usize": 376,
      "setprecision": 377,
      "queue": 378,
      "iter": 379,
      "ccw": 380,
      ")-": 381,
      "ull": 382,
      "vs": 383,
      "+(": 384,
      "conditional": 385,
      "fixed": 386,
      "]:": 387,
      "^": 388,
      "@": 389,
      "mp": 390,
      ")*": 391,
      ">>;": 392,
      "insert": 393,
      "algorithm": 394,
      "stdin": 395,
      "]==": 396,
      "back": 397,
      "par": 398,
      "]){": 399
    },
    "unk_token": "[UNK]"
  }
}