{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": false,
    "trim_offsets": true,
    "use_regex": true
  },
  "post_processor": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": false,
    "use_regex": true
  },
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "[UNK]",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "vocab": {
      "[UNK]": 0,
      "[CLS]": 1,
      "[SEP]": 2,
      "[PAD]": 3,
      "[MASK]": 4,
      "!": 5,
      "\"": 6,
      "#": 7,
      "$": 8,
      "%": 9,
      "&": 10,
      "'": 11,
      "(": 12,
      ")": 13,
      "*": 14,
      "+": 15,
      ",": 16,
      "-": 17,
      ".": 18,
      "/": 19,
      "0": 20,
      "1": 21,
      "2": 22,
      "3": 23,
      "4": 24,
      "5": 25,
      "6": 26,
      "7": 27,
      "8": 28,
      "9": 29,
      ":": 30,
      ";": 31,
      "<": 32,
      "=": 33,
      ">": 34,
      "?": 35,
      "@": 36,
      "A": 37,
      "B": 38,
      "C": 39,
      "D": 40,
      "E": 41,
      "F": 42,
      "G": 43,
      "H": 44,
      "I": 45,
      "J": 46,
      "K": 47,
      "L": 48,
      "M": 49,
      "N": 50,
      "O": 51,
      "P": 52,
      "Q": 53,
      "R": 54,
      "S": 55,
      "T": 56,
      "U": 57,
      "V": 58,
      "W": 59,
      "X": 60,
      "Y": 61,
      "Z": 62,
      "[": 63,
      "\\": 64,
      "]": 65,
      "^": 66,
      "_": 67,
      "`": 68,
      "a": 69,
      "b": 70,
      "c": 71,
      "d": 72,
      "e": 73,
      "f": 74,
      "g": 75,
      "h": 76,
      "i": 77,
      "j": 78,
      "k": 79,
      "l": 80,
      "m": 81,
      "n": 82,
      "o": 83,
      "p": 84,
      "q": 85,
      "r": 86,
      "s": 87,
      "t": 88,
      "u": 89,
      "v": 90,
      "w": 91,
      "x": 92,
      "y": 93,
      "z": 94,
      "{": 95,
      "}": 96,
      "~": 97,
      "¢": 98,
      "¤": 99,
      "¥": 100,
      "¦": 101,
      "§": 102,
      "¨": 103,
      "©": 104,
      "ª": 105,
      "®": 106,
      "¯": 107,
      "°": 108,
      "²": 109,
      "´": 110,
      "¸": 111,
      "»": 112,
      "¼": 113,
      "½": 114,
      "¾": 115,
      "¿": 116,
      "Â": 117,
      "â": 118,
      "ã": 119,
      "ä": 120,
      "å": 121,
      "æ": 122,
      "ç": 123,
      "è": 124,
      "ï": 125,
      "Ġ": 126,
      "Ģ": 127,
      "ģ": 128,
      "Ĥ": 129,
      "ĥ": 130,
      "Ħ": 131,
      "ħ": 132,
      "ī": 133,
      "Ĭ": 134,
      "ĭ": 135,
      "Į": 136,
      "į": 137,
      "İ": 138,
      "ı": 139,
      "Ĵ": 140,
      "ķ": 141,
      "ĸ": 142,
      "Ĺ": 143,
      "Ļ": 144,
      "Ľ": 145,
      "ŀ": 146,
      "Ł": 147,
      "ł": 148,
      "Ń": 149,
      "ĠĠ": 150,
      "ĠĠĠĠ": 151,
      "in": 152,
      "ĠĠĠ": 153,
      "int": 154,
      ");": 155,
      "Ġi": 156,
      "(\"": 157,
      "){": 158,
      "Ġ=": 159,
      "or": 160,
      "ĠĠĠĠĠĠĠ": 161,
      "rint": 162,
      "\",": 163,
      "print": 164,
      "ĠA": 165,
      "(\"%": 166,
      "printf": 167,
      "Ġ}": 168,
      "for": 169,
      "++": 170,
      "Ġint": 171,
      "]);": 172,
      "Ġprintf": 173,
      "Ġfor": 174,
      "];": 175,
      "Ġ0": 176,
      "Ġj": 177,
      "ĠĠĠĠĠ": 178,
      "Ġ<": 179,
      "an": 180,
      "sc": 181,
      "scan": 182,
      "scanf": 183,
      "ĠN": 184,
      "Ġn": 185,
      "++){": 186,
      "Ġ1": 187,
      "Ġa": 188,
      "io": 189,
      "\");": 190,
      "Ġ&": 191,
      "Ġ{": 192,
      "Ġscanf": 193,
      "Ġv": 194,
      "ĠĠĠĠĠĠĠĠĠĠĠ": 195,
      "Ġ(": 196,
      "st": 197,
      "de": 198,
      "ra": 199,
      "Ġk": 200,
      "le": 201,
      "id": 202,
      "oid": 203,
      "Ġ>": 204,
      ";}": 205,
      "lu": 206,
      "void": 207,
      "re": 208,
      "se": 209,
      "\",&": 210,
      "inc": 211,
      "lude": 212,
      "include": 213,
      "++)": 214,
      "std": 215,
      "ma": 216,
      "00": 217,
      "tu": 218,
      "retu": 219,
      "rn": 220,
      "return": 221,
      "main": 222,
      "hi": 223,
      "stdio": 224,
      "whi": 225,
      "while": 226,
      "Ġmain": 227,
      "--": 228,
      "Ġif": 229,
      "(\"\\": 230,
      "ey": 231,
      "ort": 232,
      "Ġ&&": 233,
      "],": 234,
      "rt": 235,
      "Ġt": 236,
      "sert": 237,
      "Ġreturn": 238,
      "Ġwhile": 239,
      "ĠĠĠĠĠĠĠĠ": 240,
      "rra": 241,
      "rray": 242,
      "insert": 243,
      "Ġ\");": 244,
      "]=": 245,
      "Ġ-": 246,
      "ion": 247,
      "--;": 248,
      "Sort": 249,
      "Ġinsert": 250,
      "ce": 251,
      "um": 252,
      "(){": 253,
      "ionSort": 254,
      "[],": 255,
      "Ġ\",": 256,
      "race": 257,
      "100": 258,
      "Ġkey": 259,
      "Ġtrace": 260,
      "ĠinsertionSort": 261,
      "Ġ*": 262,
      "Ġ>=": 263,
      ">=": 264,
      "Ġ;": 265,
      "]>": 266,
      "]);}": 267,
      "Ġ+": 268,
      "\");}": 269,
      "mp": 270,
      "key": 271,
      "Ġarray": 272,
      ">#": 273,
      "!=": 274,
      "Ġ)": 275,
      "lse": 276,
      "else": 277,
      "array": 278,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 279,
      "Ġ}}": 280,
      "num": 281,
      "Ġc": 282,
      "rr": 283,
      "Ġ<=": 284,
      "<=": 285,
      "at": 286,
      "ine": 287,
      "Ġs": 288,
      "Ġnum": 289,
      "Ġ100": 290,
      "def": 291,
      "Ġprint": 292,
      "define": 293,
      "ut": 294,
      "Ġ){": 295,
      "len": 296,
      "Ġelse": 297,
      "if": 298,
      "iz": 299,
      "ize": 300,
      "Ġ!=": 301,
      "ĠĠĠĠĠĠ": 302,
      "th": 303,
      "ata": 304,
      ");}": 305,
      "data": 306,
      "ar": 307,
      "--;}": 308,
      "leng": 309,
      "length": 310,
      "Ġ==": 311,
      "&&": 312,
      "1000": 313,
      "Ġ%": 314,
      "li": 315,
      "Ġarr": 316,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 317,
      "Ġtmp": 318,
      "ĠĠĠĠĠĠĠĠĠ": 319,
      "nt": 320,
      "put": 321,
      "Ġb": 322,
      "sort": 323,
      "Ġ\"": 324,
      "Array": 325,
      "Ġco": 326,
      "lo": 327,
      "stdli": 328,
      "stdlib": 329,
      "of": 330,
      "emp": 331,
      "size": 332,
      "==": 333,
      "Ġ1000": 334,
      "er": 335,
      "MA": 336,
      "MAX": 337,
      "har": 338,
      "nst": 339,
      "Ġlength": 340,
      "()": 341,
      "rea": 342,
      "Ġ\");}": 343,
      "loc": 344,
      "arr": 345,
      "Ġsize": 346,
      "ber": 347,
      "Ġconst": 348,
      "Ġinsertion": 349,
      "stat": 350,
      "ic": 351,
      "lloc": 352,
      "reak": 353,
      "In": 354,
      "static": 355,
      "malloc": 356,
      "out": 357,
      "unt": 358,
      "Ġdata": 359,
      "Ġe": 360,
      "\"_": 361,
      "Ġf": 362,
      "]){": 363,
      "trace": 364,
      "Ġtemp": 365,
      "Ġ'": 366,
      "Ġm": 367,
      "Ġp": 368,
      "Ġl": 369,
      "sizeof": 370,
      "ge": 371,
      "Ġx": 372,
      "str": 373,
      "Ġ);": 374,
      "es": 375,
      ");}}": 376,
      "co": 377,
      "insertionSort": 378,
      "Ġin": 379,
      "Ġd": 380,
      "Ġ++": 381,
      "Ġar": 382,
      "output": 383,
      "])": 384,
      "Ġu": 385,
      "Ġbreak": 386,
      "Ġ*,": 387,
      "\"#": 388,
      "ow": 389,
      "10": 390,
      "Ġ_": 391,
      "tmp": 392,
      "uf": 393,
      "Ġ,": 394,
      "char": 395,
      "();": 396,
      "temp": 397,
      "Ġ*)": 398,
      "count": 399,
      "Ġchar": 400,
      "Num": 401,
      "Ġvoid": 402,
      "ĠĠĠĠĠĠĠĠĠĠĠĠ": 403,
      "ĠIn": 404,
      "));": 405,
      "how": 406,
      "me": 407,
      "ĠMAX": 408,
      "ree": 409,
      "ĠprintArray": 410,
      "it": 411,
      "Ġr": 412,
      "ĠĠĠĠĠĠĠĠĠĠ": 413,
      "]);}}": 414,
      "Ġnumber": 415,
      "((": 416,
      "alu": 417,
      "Ġoutput": 418,
      "Ġ\"%": 419,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 420,
      "UM": 421,
      "Ġlen": 422,
      "op": 423,
      "tL": 424,
      "ed": 425,
      "Ġ2": 426,
      "leme": 427,
      "Ġshow": 428,
      "lement": 429,
      "64": 430,
      "la": 431,
      "Ġsort": 432,
      "sertionSort": 433,
      "xit": 434,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 435,
      "Ġfree": 436,
      "Ġary": 437,
      "--){": 438,
      "Ġ\");}}": 439,
      "--)": 440,
      "._": 441,
      "al": 442,
      "Ġput": 443,
      "number": 444,
      "bW": 445,
      "sp": 446,
      "ĠP": 447,
      "Ġcount": 448,
      ")){": 449,
      "ĠArray": 450,
      "get": 451,
      "ĠE": 452,
      "[]){": 453,
      "ange": 454,
      "loop": 455,
      "ãģ": 456,
      "Ġ*(": 457,
      "('": 458,
      "ies": 459,
      "sorties": 460,
      "ofsorties": 461,
      "))": 462,
      "break": 463,
      "xArray": 464,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 465,
      "++;": 466,
      "ing": 467,
      "ĠubW": 468,
      "to": 469,
      "Ġinsertionsort": 470,
      "Ġarg": 471,
      "isp": 472,
      "list": 473,
      "ĠinsertSort": 474,
      "nL": 475,
      "Ġ10": 476,
      "101": 477,
      "ZE": 478,
      "alues": 479,
      "Ġh": 480,
      "Ġ((": 481,
      "Ġnums": 482,
      "ard": 483,
      "uff": 484,
      "Ġnumbers": 485,
      "ap": 486,
      "ig": 487,
      "string": 488,
      "\"%": 489,
      "\"\\": 490,
      "ue": 491,
      "??": 492,
      "ax": 493,
      ";}}": 494,
      "seq": 495,
      "lements": 496,
      "');": 497,
      "IN": 498,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 499,
      "Ġnumofsorties": 500,
      "Ġexit": 501,
      "};": 502,
      "nums": 503,
      "ĠInsertionSort": 504,
      "Ġputchar": 505,
      "NUM": 506,
      "wap": 507,
      "Ġ'\\": 508,
      ")*": 509,
      "Ġstr": 510,
      "Ġz": 511,
      "ump": 512,
      "ary": 513,
      "Ġins": 514,
      "('\\": 515,
      "IZE": 516,
      "SIZE": 517,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠ": 518,
      "),": 519,
      "Ġma": 520,
      "Ġsizeof": 521,
      "Ġargc": 522,
      ",\"": 523,
      "Buff": 524,
      "LE": 525,
      "SortBuff": 526,
      "lay": 527,
      "isplay": 528,
      "mo": 529,
      "nce": 530,
      "un": 531,
      "uence": 532,
      "IT": 533,
      "ec": 534,
      "ĠNUM": 535,
      "dex": 536,
      "Ġinput": 537,
      "15": 538,
      "input": 539,
      "Ġ\"\"": 540,
      "\"\"#": 541,
      "Ġ?": 542,
      "Ġis": 543,
      "=(": 544,
      "az": 545,
      "rror": 546,
      "Ġmin": 547,
      "alue": 548,
      "ĠPrint": 549,
      "azu": 550,
      "LL": 551,
      "ULL": 552,
      "]<": 553,
      "ai": 554,
      "Ġas": 555,
      "\")": 556,
      "ned": 557,
      "Ġw": 558,
      "Ġy": 559,
      "Ġseq": 560,
      "igned": 561,
      ";++": 562,
      "signed": 563,
      "Ġget": 564,
      "Ġto": 565,
      "\");}}": 566,
      "Ġswap": 567,
      "Ġuint": 568,
      "Ġ:": 569,
      "Ġbuf": 570,
      "Number": 571,
      "*)": 572,
      "*,": 573,
      "os": 574,
      "Ġo": 575,
      "');}": 576,
      "Ġch": 577,
      "&&(": 578,
      "\"$": 579,
      "NT": 580,
      "XIT": 581,
      "ĠT": 582,
      "Ġlist": 583,
      "insertion": 584,
      "Ġ\"\\": 585,
      "Ġmax": 586,
      "*(": 587,
      "AT": 588,
      "DAT": 589,
      "ER": 590,
      "ad": 591,
      "tal": 592,
      "ĠR": 593,
      "ĠV": 594,
      "ork": 595,
      "Ġvalues": 596,
      "DATA": 597,
      "(;": 598,
      ")&&(": 599
    },
    "merges": [
      "Ġ Ġ",
      "ĠĠ ĠĠ",
      "i n",
      "ĠĠ Ġ",
      "in t",
      ") ;",
      "Ġ i",
      "( \"",
      ") {",
      "Ġ =",
      "o r",
      "ĠĠĠĠ ĠĠĠ",
      "r int",
      "\" ,",
      "p rint",
      "Ġ A",
      "(\" %",
      "print f",
      "Ġ }",
      "f or",
      "+ +",
      "Ġ int",
      "] );",
      "Ġ printf",
      "Ġ for",
      "] ;",
      "Ġ 0",
      "Ġ j",
      "ĠĠĠĠ Ġ",
      "Ġ <",
      "a n",
      "s c",
      "sc an",
      "scan f",
      "Ġ N",
      "Ġ n",
      "++ ){",
      "Ġ 1",
      "Ġ a",
      "i o",
      "\" );",
      "Ġ &",
      "Ġ {",
      "Ġ scanf",
      "Ġ v",
      "ĠĠĠĠ ĠĠĠĠĠĠĠ",
      "Ġ (",
      "s t",
      "d e",
      "r a",
      "Ġ k",
      "l e",
      "i d",
      "o id",
      "Ġ >",
      "; }",
      "l u",
      "v oid",
      "r e",
      "s e",
      "\", &",
      "in c",
      "lu de",
      "inc lude",
      "++ )",
      "st d",
      "m a",
      "0 0",
      "t u",
      "re tu",
      "r n",
      "retu rn",
      "ma in",
      "h i",
      "std io",
      "w hi",
      "whi le",
      "Ġ main",
      "- -",
      "Ġi f",
      "(\" \\",
      "e y",
      "or t",
      "Ġ& &",
      "] ,",
      "r t",
      "Ġ t",
      "se rt",
      "Ġ return",
      "Ġ while",
      "ĠĠĠĠ ĠĠĠĠ",
      "r ra",
      "rra y",
      "in sert",
      "Ġ \");",
      "] =",
      "Ġ -",
      "io n",
      "-- ;",
      "S ort",
      "Ġ insert",
      "c e",
      "u m",
      "( ){",
      "ion Sort",
      "[ ],",
      "Ġ \",",
      "ra ce",
      "1 00",
      "Ġk ey",
      "Ġt race",
      "Ġinsert ionSort",
      "Ġ *",
      "Ġ> =",
      "> =",
      "Ġ ;",
      "] >",
      "]); }",
      "Ġ +",
      "\"); }",
      "m p",
      "k ey",
      "Ġa rray",
      "> #",
      "! =",
      "Ġ )",
      "l se",
      "e lse",
      "a rray",
      "ĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠ",
      "Ġ} }",
      "n um",
      "Ġ c",
      "r r",
      "Ġ< =",
      "< =",
      "a t",
      "in e",
      "Ġ s",
      "Ġn um",
      "Ġ1 00",
      "de f",
      "Ġ print",
      "def ine",
      "u t",
      "Ġ ){",
      "le n",
      "Ġ else",
      "i f",
      "i z",
      "iz e",
      "Ġ !=",
      "ĠĠĠĠ ĠĠ",
      "t h",
      "at a",
      "); }",
      "d ata",
      "a r",
      "-- ;}",
      "len g",
      "leng th",
      "Ġ= =",
      "& &",
      "100 0",
      "Ġ %",
      "l i",
      "Ġa rr",
      "ĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠ",
      "Ġt mp",
      "ĠĠĠĠ ĠĠĠĠĠ",
      "n t",
      "p ut",
      "Ġ b",
      "s ort",
      "Ġ \"",
      "A rray",
      "Ġc o",
      "l o",
      "std li",
      "stdli b",
      "o f",
      "e mp",
      "s ize",
      "= =",
      "Ġ100 0",
      "e r",
      "M A",
      "MA X",
      "h ar",
      "n st",
      "Ġ length",
      "( )",
      "re a",
      "Ġ\"); }",
      "lo c",
      "a rr",
      "Ġs ize",
      "b er",
      "Ġco nst",
      "Ġinsert ion",
      "st at",
      "i c",
      "l loc",
      "rea k",
      "I n",
      "stat ic",
      "ma lloc",
      "o ut",
      "u nt",
      "Ġ data",
      "Ġ e",
      "\" _",
      "Ġ f",
      "] ){",
      "t race",
      "Ġt emp",
      "Ġ '",
      "Ġ m",
      "Ġ p",
      "Ġ l",
      "size of",
      "g e",
      "Ġ x",
      "st r",
      "Ġ );",
      "e s",
      ");} }",
      "c o",
      "insert ionSort",
      "Ġ in",
      "Ġ d",
      "Ġ ++",
      "Ġa r",
      "out put",
      "] )",
      "Ġ u",
      "Ġb reak",
      "Ġ* ,",
      "\" #",
      "o w",
      "1 0",
      "Ġ _",
      "t mp",
      "u f",
      "Ġ ,",
      "c har",
      "( );",
      "t emp",
      "Ġ* )",
      "co unt",
      "Ġc har",
      "N um",
      "Ġv oid",
      "ĠĠĠĠĠĠĠĠ ĠĠĠĠ",
      "Ġ In",
      ") );",
      "h ow",
      "m e",
      "Ġ MAX",
      "re e",
      "Ġprint Array",
      "i t",
      "Ġ r",
      "ĠĠĠĠĠĠĠĠ ĠĠ",
      "]);} }",
      "Ġnum ber",
      "( (",
      "a lu",
      "Ġ output",
      "Ġ\" %",
      "ĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠ",
      "U M",
      "Ġ len",
      "o p",
      "t L",
      "e d",
      "Ġ 2",
      "le me",
      "Ġs how",
      "leme nt",
      "6 4",
      "l a",
      "Ġs ort",
      "sert ionSort",
      "x it",
      "ĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ",
      "Ġf ree",
      "Ġar y",
      "-- ){",
      "Ġ\");} }",
      "-- )",
      ". _",
      "a l",
      "Ġ put",
      "num ber",
      "b W",
      "s p",
      "Ġ P",
      "Ġco unt",
      ") ){",
      "ĠA rray",
      "ge t",
      "Ġ E",
      "[ ]){",
      "an ge",
      "lo op",
      "ã ģ",
      "Ġ* (",
      "( '",
      "i es",
      "sort ies",
      "of sorties",
      ") )",
      "b reak",
      "x Array",
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ",
      "++ ;",
      "in g",
      "Ġu bW",
      "t o",
      "Ġinsertion sort",
      "Ġar g",
      "i sp",
      "li st",
      "Ġinsert Sort",
      "n L",
      "Ġ1 0",
      "10 1",
      "Z E",
      "alu es",
      "Ġ h",
      "Ġ( (",
      "Ġnum s",
      "ar d",
      "uf f",
      "Ġnumber s",
      "a p",
      "i g",
      "str ing",
      "\" %",
      "\" \\",
      "u e",
      "? ?",
      "a x",
      ";} }",
      "se q",
      "lement s",
      "' );",
      "I N",
      "ĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠ",
      "Ġnum ofsorties",
      "Ġe xit",
      "} ;",
      "num s",
      "ĠIn sertionSort",
      "Ġput char",
      "N UM",
      "w ap",
      "Ġ' \\",
      ") *",
      "Ġ str",
      "Ġ z",
      "um p",
      "ar y",
      "Ġin s",
      "(' \\",
      "I ZE",
      "S IZE",
      "ĠĠĠĠĠĠĠĠ ĠĠĠĠĠ",
      ") ,",
      "Ġ ma",
      "Ġsize of",
      "Ġarg c",
      ", \"",
      "B uff",
      "L E",
      "Sort Buff",
      "la y",
      "isp lay",
      "m o",
      "n ce",
      "u n",
      "ue nce",
      "I T",
      "e c",
      "ĠN UM",
      "de x",
      "Ġin put",
      "1 5",
      "in put",
      "Ġ\" \"",
      "\" \"#",
      "Ġ ?",
      "Ġi s",
      "= (",
      "a z",
      "rr or",
      "Ġm in",
      "alu e",
      "ĠP rint",
      "az u",
      "L L",
      "U LL",
      "] <",
      "a i",
      "Ġa s",
      "\" )",
      "n ed",
      "Ġ w",
      "Ġ y",
      "Ġ seq",
      "ig ned",
      "; ++",
      "s igned",
      "Ġ get",
      "Ġt o",
      "\");} }",
      "Ġs wap",
      "Ġu int",
      "Ġ :",
      "Ġb uf",
      "Num ber",
      "* )",
      "* ,",
      "o s",
      "Ġ o",
      "' );}",
      "Ġc h",
      "&& (",
      "\" $",
      "N T",
      "X IT",
      "Ġ T",
      "Ġ list",
      "insert ion",
      "Ġ\" \\",
      "Ġma x",
      "* (",
      "A T",
      "D AT",
      "E R",
      "a d",
      "t al",
      "Ġ R",
      "Ġ V",
      "or k",
      "Ġv alues",
      "DAT A",
      "( ;",
      ") &&("
    ]
  }
}